# Ex2 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv).

### Step 3. Assign it to a variable called chipo.

In [10]:
chipo = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv", sep="\t")
chipo

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

### Step 4. See the first 10 entries

In [11]:
chipo.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

### Step 5. What is the number of observations in the dataset?

In [1]:
# Solution 1
chipo.

In [2]:
# Solution 2

### Step 6. What is the number of columns in the dataset?

In [17]:
chipo.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

### Step 7. Print the name of all the columns.

In [16]:
chipo.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

### Step 8. How is the dataset indexed?

In [18]:
chipo

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

### Step 9. Which was the most-ordered item?

In [22]:
chipo_most_ordered = chipo[["quantity", "item_name"]]
chipo_most_ordered

      quantity                              item_name
0            1           Chips and Fresh Tomato Salsa
1            1                                   Izze
2            1                       Nantucket Nectar
3            1  Chips and Tomatillo-Green Chili Salsa
4            2                           Chicken Bowl
...        ...                                    ...
4617         1                          Steak Burrito
4618         1                          Steak Burrito
4619         1                     Chicken Salad Bowl
4620         1                     Chicken Salad Bowl
4621         1                     Chicken Salad Bowl

[4622 rows x 2 columns]

In [28]:
chipo_most = chipo_most_ordered.groupby("item_name")["quantity"].sum().sort_values(ascending=False).reset_index()
chipo_most

                                item_name  quantity
0                            Chicken Bowl       761
1                         Chicken Burrito       591
2                     Chips and Guacamole       506
3                           Steak Burrito       386
4                       Canned Soft Drink       351
5                                   Chips       230
6                              Steak Bowl       221
7                           Bottled Water       211
8            Chips and Fresh Tomato Salsa       130
9                             Canned Soda       126
10                     Chicken Salad Bowl       123
11                     Chicken Soft Tacos       120
12                          Side of Chips       110
13                         Veggie Burrito        97
14                       Barbacoa Burrito        91
15                            Veggie Bowl        87
16                          Carnitas Bowl        71
17                          Barbacoa Bowl        66
18                       Carnitas Burrito        60
19                       Steak Soft Tacos        56
20                      6 Pack Soft Drink        55
21    Chips and Tomatillo Red Chili Salsa        50
22                   Chicken Crispy Tacos        50
23  Chips and Tomatillo Green Chili Salsa        45
24                    Carnitas Soft Tacos        40
25                     Steak Crispy Tacos        36
26  Chips and Tomatillo-Green Chili Salsa        33
27                       Steak Salad Bowl        31
28                       Nantucket Nectar        29
29    Chips and Tomatillo-Red Chili Salsa        25
30                    Barbacoa Soft Tacos        25
31     Chips and Roasted Chili Corn Salsa        23
32                                   Izze        20
33                      Veggie Salad Bowl        18
34     Chips and Roasted Chili-Corn Salsa        18
35                  Barbacoa Crispy Tacos        12
36                    Barbacoa Salad Bowl        10
37                          Chicken Salad         9
38                  Carnitas Crispy Tacos         8
39                      Veggie Soft Tacos         8
40                                Burrito         6
41                           Veggie Salad         6
42                    Carnitas Salad Bowl         6
43                                   Bowl         4
44                            Steak Salad         4
45                                  Salad         2
46                           Crispy Tacos         2
47      Chips and Mild Fresh Tomato Salsa         1
48                         Carnitas Salad         1
49                    Veggie Crispy Tacos         1

### Step 10. For the most-ordered item, how many items were ordered?

In [35]:
print(chipo_most[:1]["quantity"])

0    761
Name: quantity, dtype: int64

### Step 11. What was the most ordered item in the choice_description column?

In [46]:
chipo_choice = chipo.groupby("choice_description")["quantity"].sum().sort_values(ascending=False).reset_index()
chipo_choice

                                     choice_description  quantity
0                                           [Diet Coke]       159
1                                                [Coke]       143
2                                              [Sprite]        89
3     [Fresh Tomato Salsa, [Rice, Black Beans, Chees...        49
4     [Fresh Tomato Salsa, [Rice, Black Beans, Chees...        42
...                                                 ...       ...
1038  [Roasted Chili Corn Salsa, [Fajita Vegetables,...         1
1039  [Roasted Chili Corn Salsa, [Fajita Vegetables,...         1
1040  [Roasted Chili Corn Salsa, [Fajita Vegetables,...         1
1041  [Roasted Chili Corn Salsa, [Guacamole, Sour Cr...         1
1042  [[Tomatillo-Red Chili Salsa (Hot), Tomatillo-G...         1

[1043 rows x 2 columns]

In [44]:
chipo_choice[:1]["choice_description"]

0    [Diet Coke]
Name: choice_description, dtype: object

### Step 12. How many items were orderd in total?

In [45]:
chipo_choice[:1]["quantity"]

0    159
Name: quantity, dtype: int64

### Step 13. Turn the item price into a float

In [47]:
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

#### Step 13.a. Check the item price type

In [52]:
chipo["item_price"]

0        $2.39
1        $3.39
2        $3.39
3        $2.39
4       $16.98
         ...
4617    $11.75
4618    $11.75
4619    $11.25
4620     $8.75
4621     $8.75
Name: item_price, Length: 4622, dtype: object

#### Step 13.b. Create a lambda function and change the type of item price

In [53]:
splt = lambda s : s[1:]

In [55]:
chipo["item_price"] = chipo["item_price"].apply(splt)
chipo["item_price"]

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
         ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: object

In [57]:
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [60]:
chipo["item_price"].dtype

dtype('O')

In [61]:
chipo["item_price"] = chipo["item_price"].astype(float)
chipo["item_price"]

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
        ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: float64

#### Step 13.c. Check the item price type

In [62]:
chipo["item_price"].dtype

dtype('float64')

### Step 14. How much was the revenue for the period in the dataset?

In [63]:
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [64]:
chipo_rev = chipo[["quantity", "item_price"]]
chipo_rev

      quantity  item_price
0            1        2.39
1            1        3.39
2            1        3.39
3            1        2.39
4            2       16.98
...        ...         ...
4617         1       11.75
4618         1       11.75
4619         1       11.25
4620         1        8.75
4621         1        8.75

[4622 rows x 2 columns]

In [65]:
chipo_rev["revenue"] = chipo["quantity"] * chipo["item_price"]
chipo_rev.head()

/tmp/ipykernel_162131/1434680372.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  chipo_rev["revenue"] = chipo["quantity"] * chipo["item_price"]

   quantity  item_price  revenue
0         1        2.39     2.39
1         1        3.39     3.39
2         1        3.39     3.39
3         1        2.39     2.39
4         2       16.98    33.96

In [66]:
chipo_revenue = chipo_rev["revenue"].sum()
chipo_revenue

39237.02

### Step 15. How many orders were made in the period?

In [68]:
chipo["order_id"].nunique()

1834

In [74]:
chipo["order_id"].unique().max()

1834

### Step 16. What is the average revenue amount per order?

In [77]:
# Solution 1
chipo_rev["order_id"] = chipo["order_id"].astype("str")
chipo_rev

/tmp/ipykernel_162131/435833340.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  chipo_rev["order_id"] = chipo["order_id"].astype("str")

      quantity  item_price  revenue order_id
0            1        2.39     2.39        1
1            1        3.39     3.39        1
2            1        3.39     3.39        1
3            1        2.39     2.39        1
4            2       16.98    33.96        2
...        ...         ...      ...      ...
4617         1       11.75    11.75     1833
4618         1       11.75    11.75     1833
4619         1       11.25    11.25     1834
4620         1        8.75     8.75     1834
4621         1        8.75     8.75     1834

[4622 rows x 4 columns]

In [79]:
chipo_rev_mean = chipo_rev.groupby("order_id")["revenue"].mean().reset_index()
chipo_rev_mean

     order_id    revenue
0           1   2.890000
1          10   6.600000
2         100   5.040000
3        1000  10.250000
4        1001   5.040000
...       ...        ...
1829      995   8.316667
1830      996  10.750000
1831      997  45.000000
1832      998   5.440000
1833      999   7.937500

[1834 rows x 2 columns]

In [81]:
chipo_rev_mean.query("order_id == '2'")

    order_id  revenue
946        2    33.96

In [85]:
chipo_rev_mean.loc[chipo_rev_mean["order_id"] == '2']

    order_id  revenue
946        2    33.96

In [87]:
chipo_rev_mean[chipo_rev_mean["order_id"] == '2']

    order_id  revenue
946        2    33.96

### Step 17. How many different items are sold?

In [89]:
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [97]:
chipo["item_name"].nunique()

50